tap "adoptopenjdk/openjdk"
tap "apple-yagi/tap"
tap "carlocab/personal"
tap "cockroachdb/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "minacle/chntpw"
tap "rbenv/tap"
tap "shivammathur/php"
brew "libpng"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "icu4c", link: true
brew "openssl@3"
brew "appium"
brew "apr"
brew "autoconf"
brew "automake"
brew "pycparser"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "bison"
brew "bzip2"
brew "gmp"
brew "gcc"
brew "python@3.12"
brew "bzt"
brew "gettext"
brew "tbb"
brew "cmake"
brew "cocoapods"
brew "curl", link: true
brew "libtool"
brew "freetds"
brew "gd"
brew "libzip"
brew "oniguruma"
brew "tidy-html5"
brew "php"
brew "composer"
brew "libevent"
brew "exiftool"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "tesseract"
brew "ffmpeg"
brew "flow"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gradle"
brew "hdf5"
brew "httpd"
brew "icarus-verilog"
brew "libheif"
brew "liblqr"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "libbpg"
brew "libedit"
brew "libiconv"
brew "libmemcached"
brew "libwpg"
brew "libxml2", link: true
brew "libxslt"
brew "make"
brew "maven"
brew "mhash"
brew "mcrypt"
brew "mkcert"
brew "mysql"
brew "openssl@1.1"
brew "mysql@5.7"
brew "neovim"
brew "nodebrew"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "pcre"
brew "php-cs-fixer"
brew "php@8.0"
brew "pkg-config"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qt@5"
brew "pyqt@5"
brew "python@3.10"
brew "ruby-build"
brew "rbenv"
brew "re2c"
brew "switchaudio-osx"
brew "volta"
brew "watchman"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "carlocab/personal/unrar"
brew "cockroachdb/tap/cockroach"
brew "jakehilborn/jakehilborn/displayplacer"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "minacle/chntpw/chntpw"
brew "rbenv/tap/openssl@1.0"
brew "shivammathur/php/php@7.3"
cask "android-studio"
cask "canva"
cask "chromedriver"
cask "notion-calendar"
cask "cursor"
cask "docker"
cask "fantastical"
cask "genymotion"
cask "hammerspoon"
cask "libreoffice"
cask "libreoffice-language-pack", args: { language: "ja" }
cask "mysqlworkbench"
cask "ngrok"
cask "notion-calendar"
cask "postman"
cask "raycast"
cask "visual-studio-code-insiders"
cask "warp"
cask "zulu11"
vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthonydiametrix.acf-snippet"
vscode "asvetliakov.vscode-neovim"
vscode "austenc.laravel-blade-spacer"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clcxce.motorola-68k-assembly"
vscode "codeium.codeium"
vscode "codingyu.laravel-goto-view"
vscode "cschlosser.doxdocgen"
vscode "ctf0.laravel-goto-controller"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "evzen-wybitul.magic-racket"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "georgewfraser.vscode-javac"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.heygithub"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "hookyqr.beautify"
vscode "icrawl.discord-vscode"
vscode "isobe-h.markdown-character-count"
vscode "james-yu.latex-workshop"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jeff-hykin.better-cpp-syntax"
vscode "junstyle.php-cs-fixer"
vscode "kevinrose.vsc-python-indent"
vscode "leonardssh.vscord"
vscode "mdickin.markdown-shortcuts"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mshr-h.veriloghdl"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "naco-siren.gradle-language"
vscode "neilbrayfield.php-docblocker"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "pegleg.codachi"
vscode "pizzacat83.codic"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "pnp.polacode"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "ritwickdey.liveserver"
vscode "ryannaddy.laravel-artisan"
vscode "sdras.night-owl"
vscode "shardulm94.trailing-spaces"
vscode "tungvn.wordpress-snippet"
vscode "tushortz.python-extended-snippets"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "walkme.java-extension-pack"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
